// BSLLS-off
&Вместо("Валидировать")
Функция Мок_Валидировать(Знач МодельДанных, Знач ИмяСхемы = Неопределено, Знач Спецификация = Неопределено)
	ПараметрыМетода = Мокито.МассивПараметров(МодельДанных,ИмяСхемы, Спецификация);
	ПрерватьВыполнение = Ложь;
	
	Результат = МокитоПерехват.АнализВызова(инт_ВалидаторПакетов, "Валидировать", ПараметрыМетода, ПрерватьВыполнение);
	
	Если Не ПрерватьВыполнение Тогда
		Возврат ПродолжитьВызов(МодельДанных,ИмяСхемы, Спецификация);
	Иначе
		Возврат Результат;
	КонецЕсли;
КонецФункции
