&Вместо("ПолучитьДанныеОчередиПоИдентификатору")
Функция Мок_ПолучитьДанныеОчередиПоИдентификатору(ИдентификаторСообщения, СписокПолей)
  ПараметрыМетода = Мокито.МассивПараметров(ИдентификаторСообщения, СписокПолей);
  ПрерватьВыполнение = Ложь;

  Результат = МокитоПерехват.АнализВызова(РегистрыСведений.инт_ОчередьИсходящихСообщений, "ПолучитьДанныеОчередиПоИдентификатору", ПараметрыМетода, ПрерватьВыполнение);

  Если Не ПрерватьВыполнение Тогда
    Возврат ПродолжитьВызов(ИдентификаторСообщения, СписокПолей);
  Иначе
    Возврат Результат;
  КонецЕсли;
КонецФункции

