// BSLLS:NestedFunctionInParameters-off

#Область ПрограммныйИнтерфейс

// Возвращает список ошибок модели данных.
//
// Параметры:
//  МодельДанных - Структура - Проверяемый объект.
//               - Массив   - Проверяемый объект.
//  ИмяСхемы     - Строка - Имя схемы данных из спецификации.
//  Спецификация - Строка, СправочникСсылка.инт_Схемы - Спецификация OpenAPI 3.0 в формате JSON или ссылка на справочник ее содержащий.
// 
// Возвращаемое значение:
//  Массив - Список ошибок.
//
Функция Валидировать(Знач МодельДанных, Знач ИмяСхемы, Знач Спецификация) Экспорт
	Обработка = Обработки.ВалидаторПакетов.Создать();
	Возврат Обработка.Валидировать(МодельДанных, ИмяСхемы, Спецификация);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
