// BSLLS:NestedFunctionInParameters-off

#Область ПрограммныйИнтерфейс

// Возвращает список ошибок модели данных.
//
// Параметры:
//  МодельДанных - Структура, Соответствие, Массив, Строка, Число - Проверяемый объект.
//  ИмяСхемы     - Строка - Имя схемы данных из спецификации.
//  Спецификация - Строка - Спецификация OpenAPI 3.0 в формате JSON.
// 
// Возвращаемое значение:
//  Массив - Список ошибок.
//
Функция Валидировать(Знач МодельДанных, Знач ИмяСхемы, Знач Спецификация) Экспорт // BSLLS:Typo-off
	Обработка = Обработки.ВалидаторПакетов.Создать();
	Возврат Обработка.Валидировать(МодельДанных, ИмяСхемы, Спецификация);
	
КонецФункции

#КонецОбласти
