
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СхемаOpenApi = Обработки.ПримерРаботыВалидатора.ПолучитьМакет("OpenApi").ПолучитьТекст();
	ЗагрузитьJsonДляПроверки();
	
КонецПроцедуры

&НаКлиенте
Процедура Валидировать(Команда)
	ВалидироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалидироватьНаСервере()
	МодельДанных = ВалидаторПакетовПовтИсп.JsonВОбъект(Объект.JsonДляПроверки);
	МассивОшибок = ВалидаторПакетов.Валидировать(МодельДанных, "complex_object", Объект.СхемаOpenApi);
	
	Если МассивОшибок.количество() = 0 Тогда
		Сообщить("Валидация прошла успешно!");
		Возврат;
	КонецЕсли;
	
	Для Каждого Ошибка Из МассивОшибок Цикл
		Сообщить(Ошибка,СтатусСообщения.Внимание);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьJsonДляПроверки()
Если Переключатель Тогда
	ИмяМакета = "НевалидныйJson";
Иначе
	ИмяМакета = "Валидныйjson";
КонецЕсли;
Объект.JsonДляПроверки = Обработки.ПримерРаботыВалидатора.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	ЗагрузитьJsonДляПроверки();
КонецПроцедуры
