// BSLLS-off
&Вместо("ОбработкаВходящегоСообщенияПоПотоку")
Процедура Мок_ОбработкаВходящегоСообщенияПоПотоку(Сообщение, ПотокДанных, ИдентификаторСообщения = Неопределено)
  ПараметрыМетода = Мокито.МассивПараметров(Сообщение, ПотокДанных, ИдентификаторСообщения);
  ПрерватьВыполнение = Ложь;

  МокитоПерехват.АнализВызова(инт_ОбработкаВходящихПотоков, "ОбработкаВходящегоСообщенияПоПотоку", ПараметрыМетода, ПрерватьВыполнение);

  Если Не ПрерватьВыполнение Тогда
    ПродолжитьВызов(Сообщение, ПотокДанных, ИдентификаторСообщения);
  КонецЕсли;
КонецПроцедуры
